Tekla Open API Reference for Tekla Structures 2025
RebarThreadingDataNullable Class
 The RebarThreadingDataNullable class defines the threading properties at the end of a reinforcing bar affected by a RebarEndDetailModifier. If a threading property is null then that property will not be applied to the RebarSet generated reinforcing bars.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarThreadingDataNullable
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarThreadingDataNullable
<SerializableAttribute>
Public Class RebarThreadingDataNullable
The RebarThreadingDataNullable type exposes the following members.
Constructors
Name | Description
RebarThreadingDataNullable
 Initializes a new instance of the RebarThreadingDataNullable class.
Top
Properties
Name | Description
ExtraFabricationLength
 Gets or sets the extra fabrication length.
Length
 Gets or sets the threading length.
ThreadingType
 Gets or sets the threading type. Null indicates that the threading type is not specified.
Top
See Also
Reference
Tekla.Structures.Model Namespace